---
kind: method
id: M:Autodesk.Revit.DB.Transform2D.CreateIdentity
source: html/7035cbd5-61fc-432a-abe9-8ba0200ed4dd.htm
---
# Autodesk.Revit.DB.Transform2D.CreateIdentity Method

Creates the identity transformation.

## Syntax (C#)
```csharp
public static Transform2D CreateIdentity()
```

## Returns
The identity transformation.

## Remarks
The identity transformation does not change a point or a vector that it is applied to.